app/controllers/blocks_controller.rb

  def index
    @blocks = Block.all
---
SELECT * FROM `blocks`

  def show
    @block = Block.find(params[:id])
---
SELECT * FROM `blocks` WHERE (`blocks`.`id` = 11)

  def create
    @block = Block.new(params[:block])

    respond_to do |format|
      if @block.save
---
INSERT INTO `blocks` (`name`, `updated_at`, `postcode`, `build_date`, `created_at`) VALUES('retrwt', '2010-04-05 13:16:02', 'wt', '2010-04-05', '2010-04-05 13:16:02')

  def list
    @blocks = Block.find :all
    @categories = Category.find :all
---
SELECT * FROM `blocks`
SELECT * FROM `categories` WHERE (`categories`.`id` = 2)

  def show_expiry_date
    block = Block.find(params[:block_id])
---
SELECT * FROM `blocks` WHERE (`blocks`.`id` = 1)

  def show_upload_form
    block = Block.find(params[:id])
---
SELECT * FROM `blocks` WHERE (`blocks`.`id` = 1)

  def upload_document
    block = Block.find(params[:block_id])
    category = Category.find_by_name(params[:category_list])

    @document = Document.new(params["attachment_metadata"])
    @document.block = block
    @document.category = category
    @document.expiry_date = Date.civil(params[:post][:"expiry_date(1i)"].to_i,params[:post][:"expiry_date(2i)"].to_i,params[:post][:"expiry_date(3i)"].to_i)
    if @document.save
---
SELECT * FROM `blocks` WHERE (`blocks`.`id` = 1)
SELECT * FROM `categories` WHERE (`categories`.`name` = 'Fire Risk Assessment') LIMIT 1
INSERT INTO `documents` (`content_type`, `size`, `updated_at`, `block_id`, `expiry_date`, `category_id`, `filename`, `created_at`) VALUES('image/jpeg', 14332, '2010-04-05 13:15:37', 1, '2010-04-05', 2, 'aa.JPG', '2010-04-05 13:15:37')

  def write_popup_upload_document
    @block = Block.find(params[:id])
    @categories = Category.find :all
---
SELECT * FROM `blocks` WHERE (`blocks`.`id` = 1)
SELECT * FROM `categories`

  def download
    @document = Document.find(params[:id])
---
SELECT * FROM `documents` WHERE (`documents`.`id` = 1)

  def delete_document
    @document = Document.find(params[:id])
    @document.destroy
---
SELECT * FROM `documents` WHERE (`documents`.`id` = 1)
DELETE FROM `documents` WHERE `id` = 1